Tekla.Structures.Analysis.AnalysisPartBarAttributes.ForceStraightSegmentsEnum
The straight force segments.

Tekla.Structures.Analysis.AnalysisPartBarAttributes.ForceStraightSegmentsEnum.FORCE_STRAIGHT_SEGMENTS_NOT_SET
The straight force segments setting "not set".

Tekla.Structures.Analysis.AnalysisPartBarAttributes.ForceStraightSegmentsEnum.FORCE_STRAIGHT_SEGMENTS_YES
The straight force segments setting "yes".

Tekla.Structures.Analysis.AnalysisPartBarAttributes.ForceStraightSegmentsEnum.FORCE_STRAIGHT_SEGMENTS_NO
The straight force segments setting "no".